#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main_menu()
{
	int menu;
	
	printf("==============================================\n");
	printf("\n");
	printf("	  차량 정산 프로그램 v1.0\n");
	printf("\n");
	printf("==============================================\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("1.차량번호 조회\n");
	printf("\n");
	printf("\n");
	printf("2.정산\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("\n");
	printf("==============================================\n");
	printf("선택:");
	scanf("%d", &menu);
	printf("\n");
	return menu;
	//-> 차량번호 입력(숫자 네자리 입력하지 않으면 다시 입력창) -> 차량번호, 입차시간 출력 ( / 2.홈화면)
			//반복문(차량번호 입력 -> 차량번호를 확인해주세요.(1.다음/ 2.홈화면)) // -> 
	//1. : 출차시간을 입력해주세요 -> 입차,출차,이용시간,금액 출력// 현금이나 카드를 넣어주세요 1.현금 2.카드 3. 홈화면)     //2. : 메인메뉴 출력
	
	//1.현금을 넣어주세요(지폐만 가능) -> 결제과정-> /....영수증을 출력하시겠습니까?(1.예/ 2.아니오) -> 감사합니다 안녕히가십시오.
	//2.카드를 ic칩 방향으로 넣어주세요 ... 결제중입니다...영수증을 출력하시겠습니까?(1.예/ 2.아니오) ->감사합니다 안녕히가십시오.
	
}

